documentation.tex
% Created 2020-09-16 Wed 14:13
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[, germanb]{babel}
\author{Jakob Klemm}
\date{\today}
\title{Simulation}
\hypersetup{
 pdfauthor={Jakob Klemm},
 pdftitle={Simulation},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)},
 pdflang={Germanb}}
\begin{document}

\maketitle
\tableofcontents

\section{Einführung}
\label{sec:org303e3d8}
Auch wenn sich die Flugbahn einer \texttt{Saturn V} gut in \texttt{Excel} oder einem ähnlichen
Programm berechnen lässt, so sind diese Programme doch limitiert. Sowohl in
ihrer Geschwindigkeit, als auch ihn den Funktionen und Einstellungen, welche für
eine solche Simulation relevant sein könnten. Mit den wenigen Werten, welche uns
für diese Simulationen zur Verfügung standen, war es schnell möglich neue Werte
und Flugbahnen zu berechnen.

Und trotzdem ist es äusserst kompliziert, die Simulation interaktiv zu gestalten
und dem Betrachter die Möglichkeit zu geben, selber die Kontrolle zu übernehmen.
Dazu kommt ebenfalls noch die starke Systemgebundenheit solcher Dateien. Auch
wenn \texttt{Excel} weit verbreitet ist und es genügend kostenlose Alternativen gibt,
welche in der Lage sind \texttt{Excel-Dateien} zu öffnen, ist man doch an die Funktionen
und Bedingungen dieser Programme gebunden. Obwohl einige \emph{kostenlos} sind, findet
man kaum \emph{freie} oder gar \emph{open-source} Varianten.

Die Formeln und Konzepte, mit welchen sich die Geschwindigkeiten und Flugbahnen
einer \texttt{Saturn V} berechnet werden, lassen sich unter verschiedenen Bedienungen und
für verschiedene Raketen oder Flugobjekte anwenden. Um den Prozess interaktiver
und intuitiver zu machen, war es von Nöten die Simulation als ein ausführbares,
interaktives Programm zu implementieren.
\section{Implementierung}
\label{sec:orgc3fd095}
Der Begriff "\emph{Raketensimulator}" verbinden die meisten im ersten Moment mit
Supercomputern und hoch komplexen Berechnungen. Trotzdem lässt sich das meiste
auf einfache, lineare oder exponentielle Gleichungen bringen, die von Hand oder
bereits mit einem einfachen Taschenrechner gelöst werden können.

Daher war auch die Wahl der Programmiersprache eher offen, da die Berechnungen
selbst nicht besonders aufwendig sind. Trotzdem gab es einige Kriterien, welche
eine Programmiersprache für diese Aufgabe erfüllen musste.
\begin{itemize}
\item Die Fähigkeit Dateien zu lesen, zu interpretieren und zu schreiben.
\item Einfache, lineare Algebra sowie häufige mathematische Funktionen.
\item Zugriff auf externe Programme über eine standardisierte Schnittstelle.
\item Kompilierung in eine alleinstehende, ausführbare Datei.
\end{itemize}

Auch wenn viele Sprachen und Programme zur Verfügung standen, fiel die Wahl auf
\texttt{Golang}, eine Sprache die ursprünglich von \texttt{Google} entwickelt wurde. \texttt{Golang}
erlaubt es Entwicklern schnelle, parallele und nebenläufige Programme systemnah
zu schreiben.
\end{document}
